Revit 2027 API
SpaceTag.Space Property
The space that the tag is associated with.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Space Space { get; }
Public ReadOnly Property Space As Space
	Get
public:
property Space^ Space {
	Space^ get ();
}
member Space : Space with get
Property Value
Space
Remarks
In rare cases, the tag may not be associated to a space. The property will be null in these situations.
See Also
Reference
SpaceTag Class
Autodesk.Revit.DB.Mechanical Namespace